# St7SetFrequencyPeriodTableUnits

Sets the units for the specified Factor vs Frequency/Period table.

long St7SetFrequencyPeriodTableUnits(long uID, long TableID, long UnitType)
Input Parameters
uID
Strand7 model file ID.
TableID
Table ID.
UnitType
One of fuNone, fuDispResponse, fuVelResponse, fuAccelResponse, fuDispPSD, fuVelPSD, fuAccelPSD,
fuAccelResponseG or fuAccelPSDG.